In [17]:
import pandas as pd
df = pd.read_csv("C:\\Users\\user\\Downloads\\student_dataset.csv")

In [23]:
print(df.head())  #top 5 entries will be shown

   StudentID    Name  Gender           Course  Age  Marks Grade       City
0       2001    Isha  Female     Data Science   27     82     F  Bangalore
1       2002   Aarav  Female     Data Science   27     42     A  Hyderabad
2       2003  Vivaan    Male  Web Development   24     98     B    Kolkata
3       2004   Sanya  Female  Web Development   23     52     A  Hyderabad
4       2005   Anaya  Female  Web Development   28     51     A  Hyderabad

In [25]:
print(df.tail()) #last 5 entries are shown

     StudentID   Name  Gender           Course  Age  Marks Grade       City
145       2146  Anaya    Male  Cloud Computing   19     44     B  Bangalore
146       2147  Meera  Female          AI & ML   18     57     D  Hyderabad
147       2148  Kabir  Female  Cloud Computing   21     92     F  Bangalore
148       2149  Sanya  Female   Cyber Security   26     60     D      Delhi
149       2150   Diya  Female          AI & ML   24     44     F      Delhi

In [27]:
print(df.info()) # gives you a summary of the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  150 non-null    int64
 1   Name       150 non-null    object
 2   Gender     150 non-null    object
 3   Course     150 non-null    object
 4   Age        150 non-null    int64
 5   Marks      150 non-null    int64
 6   Grade      150 non-null    object
 7   City       150 non-null    object
dtypes: int64(3), object(5)
memory usage: 9.5+ KB
None

In [35]:
print(df.shape) #dimension of table

(150, 8)

In [53]:
df = df.drop('Age', axis=1) #table named age is deleted

In [55]:
print(df.head())

   StudentID    Name  Gender           Course  Marks Grade       City
0       2001    Isha  Female     Data Science     82     F  Bangalore
1       2002   Aarav  Female     Data Science     42     A  Hyderabad
2       2003  Vivaan    Male  Web Development     98     B    Kolkata
3       2004   Sanya  Female  Web Development     52     A  Hyderabad
4       2005   Anaya  Female  Web Development     51     A  Hyderabad

In [65]:
print(df['Grade']) #perticular table is shown

0      F
1      A
2      B
3      A
4      A
      ..
145    B
146    D
147    F
148    D
149    F
Name: Grade, Length: 150, dtype: object

In [67]:
df[df['Marks'] > 50] #marks greater tha 50 is shown

     StudentID    Name  Gender           Course  Marks Grade       City
0         2001    Isha  Female     Data Science     82     F  Bangalore
2         2003  Vivaan    Male  Web Development     98     B    Kolkata
3         2004   Sanya  Female  Web Development     52     A  Hyderabad
4         2005   Anaya  Female  Web Development     51     A  Hyderabad
5         2006   Aarav    Male  Web Development     96     D     Mumbai
..         ...     ...     ...              ...    ...   ...        ...
143       2144   Sanya  Female  Web Development     59     D    Kolkata
144       2145   Anaya  Female  Cloud Computing     65     D  Hyderabad
146       2147   Meera  Female          AI & ML     57     D  Hyderabad
147       2148   Kabir  Female  Cloud Computing     92     F  Bangalore
148       2149   Sanya  Female   Cyber Security     60     D      Delhi

[122 rows x 7 columns]

In [69]:
print(df.isnull()) #returns the table with null value if any

     StudentID   Name  Gender  Course  Marks  Grade   City
0        False  False   False   False  False  False  False
1        False  False   False   False  False  False  False
2        False  False   False   False  False  False  False
3        False  False   False   False  False  False  False
4        False  False   False   False  False  False  False
..         ...    ...     ...     ...    ...    ...    ...
145      False  False   False   False  False  False  False
146      False  False   False   False  False  False  False
147      False  False   False   False  False  False  False
148      False  False   False   False  False  False  False
149      False  False   False   False  False  False  False

[150 rows x 7 columns]

In [71]:
df[df.isnull().any(axis=1)]

Empty DataFrame
Columns: [StudentID, Name, Gender, Course, Marks, Grade, City]
Index: []

In [73]:
print(df.isnull().sum()) #number of null value is shown (if any)

StudentID    0
Name         0
Gender       0
Course       0
Marks        0
Grade        0
City         0
dtype: int64

In [75]:
df = df.fillna(0)

In [77]:
print(df.head())

   StudentID    Name  Gender           Course  Marks Grade       City
0       2001    Isha  Female     Data Science     82     F  Bangalore
1       2002   Aarav  Female     Data Science     42     A  Hyderabad
2       2003  Vivaan    Male  Web Development     98     B    Kolkata
3       2004   Sanya  Female  Web Development     52     A  Hyderabad
4       2005   Anaya  Female  Web Development     51     A  Hyderabad

In [79]:
df = df.sort_values('City') #student with same city is display

In [81]:
print(df.head())

    StudentID    Name  Gender           Course  Marks Grade       City
0        2001    Isha  Female     Data Science     82     F  Bangalore
37       2038   Anaya    Male  Web Development     59     C  Bangalore
44       2045  Vivaan  Female          AI & ML     60     D  Bangalore
48       2049    Isha    Male  Web Development     57     A  Bangalore
49       2050    Isha    Male  Web Development     94     D  Bangalore

In [85]:
df = df[df.sort_values('City')== Hyderabad ]

NameError: name 'Hyderabad' is not defined